# GetReferencePick Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberSystem..::..GetReferencePick Method
NumberSystem Class See Also
---
Gets the reference curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Reference GetReferencePick()
```

Visual Basic
---
```text
Public Function GetReferencePick As Reference
```

Visual C++
---
```text
public:
Reference^ GetReferencePick()
```

# ### Return Value
The pick of reference curve.
# See Also
NumberSystem Class
Autodesk.Revit.DB Namespace